InformationRegisters/СтавкиНалогаНаИмущество.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>СтавкиНалогаНаИмущество</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НалоговаяСтавка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОсвобождениеОтНалогообложения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодНалоговойЛьготыОсвобождениеОтНалогообложения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>7</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СнижениеНалоговойСтавки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СниженнаяНалоговаяСтавка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УменьшениеСуммыНалогаВПроцентах</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроцентУменьшения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НалоговаяСтавкаДвижимоеИмущество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОсвобождениеОтНалогообложенияДвижимогоИмущества</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СнижениеНалоговойСтавкиДвижимоеИмущество</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СтавкиНалогаНаИмущество/Ext/ManagerModule.bsl
Процедура ОбновитьЗаписиСтавкаНалогаДвижимогоИмуществаС2018() Экспорт
	
	НаборЗаписей = РегистрыСведений.СтавкиНалогаНаИмущество.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	
	ЗаписиКУдалению = Новый Массив;
	Для Каждого Запись Из НаборЗаписей Цикл
		Если Не ЗначениеЗаполнено(Запись.Организация) Тогда
			ЗаписиКУдалению.Добавить(Запись);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого УдаляемаяЗапись Из ЗаписиКУдалению Цикл
		НаборЗаписей.Удалить(УдаляемаяЗапись);
	КонецЦикла;
	
	НаборЗаписей.Записать();
	
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НаборЗаписей[0].НалоговаяСтавкаДвижимоеИмущество) Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписей.ДополнительныеСвойства.Вставить("ПропуститьПроверкуЗапретаИзменения");
	КоличествоЗаписей = НаборЗаписей.Количество();
	
	ИндексМаксимальнойЗаписиДо2018 = Новый Соответствие;
	Для Сч = 0 По КоличествоЗаписей - 1 Цикл
		
		Запись = НаборЗаписей[Сч];
		
		Если Не ЗначениеЗаполнено(Запись.НалоговаяСтавка) Тогда
			Запись.НалоговаяСтавка = 2.2;
		КонецЕсли;
		
		Если Запись.Период < '2018-01-01' И Запись.Активность Тогда
			ИндексМаксимальнойЗаписиДо2018.Вставить(Запись.Организация, Сч);
			Запись.НалоговаяСтавкаДвижимоеИмущество = Запись.НалоговаяСтавка;
			Запись.ОсвобождениеОтНалогообложенияДвижимогоИмущества = Истина;
			
		ИначеЕсли Запись.Период >= '2018-01-01' И Запись.Активность Тогда
			ИндексМаксимальнойЗаписиДо2018.Вставить(Запись.Организация, Неопределено);
			Запись.НалоговаяСтавкаДвижимоеИмущество = 1.1;
			
		КонецЕсли;
		
		Если Запись.СнижениеНалоговойСтавки Тогда
			Запись.НалоговаяСтавка = Запись.СниженнаяНалоговаяСтавка;
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого КлючЗначение Из ИндексМаксимальнойЗаписиДо2018 Цикл
		Если КлючЗначение.Значение = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяЗапись = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяЗапись, НаборЗаписей[КлючЗначение.Значение]);
		НоваяЗапись.Период = '2018-01-01';
		НоваяЗапись.НалоговаяСтавкаДвижимоеИмущество = 1.1;
		НоваяЗапись.ОсвобождениеОтНалогообложенияДвижимогоИмущества = Ложь;
		
	КонецЦикла;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры
